<template>
  <div class="blog-news container">
    <a-breadcrumbs :items="breadcrumbs" />
    <h2 class="title-h2">Новости об обучении в сфере среднего профессионального образования</h2>
    <nav class="blog-news__nav f-text-m section-m">
      <ul>
        <NuxtLink to="/blog" class="blog-news__nav-item"><li>Все</li></NuxtLink>
        <NuxtLink to="/blog/news" class="blog-news__nav-item"><li>Новости</li></NuxtLink>
        <NuxtLink to="/blog/articles" class="blog-news__nav-item"><li>Статьи</li></NuxtLink>
      </ul>
      <a-search placeholder="Найти в блоге" textSize="m" :isSearch="true" />
    </nav>
    <div class="blog-news__tags f-text-xs violet-100">
      <div v-for="(tag, index) in tags" :key="index" class="blog-news__tags-tag" @click="setActive($event.target)">
        {{ tag }}
      </div>
    </div>
    <div class="blog-news__articles">
      <a-select placeholder="Выберите вариант" :options="speciality" hint="Сортировка" />
    </div>
    <div class="blog-news__articles">
      <m-news-card v-for="(news1, index) in news" :key="index" :info="news1" />
    </div>
    <div class="f-btn-college section-m">
      <a-button label="Показать ещё" color="violet-5" size="medium" textSize="f-text-s" />
    </div>
    <s-form
      title="Всегда будь в курсе!"
      subtitle="Подпишись на рассылку, читай, где тебе удобно и как удобно!"
      type="mail"
      checkboxLabel="Я согласен на получение информационных рассылок, а также принимаю <br> 
      условия <a href='/' target='_blank' class='s-form__politics'>Политики   конфиденциальности сайта Колледжи.рф</a>"
    />
    <s-now-read-news :news="news" />
    <s-quiz class="section-l" />
  </div>
</template>

<script setup>
const breadcrumbs = [{ label: 'Статьи и новости' }];
const tags = [
  'Колледжи',
  'Самое интересное',
  'Образование',
  'Поступление',
  'Стоимость',
  'Приёмная комиссия',
  'Можно учиться и работать?',
  'Как поступить?',
  'Как выбрать колледж?',
  'Можно учиться и работать?',
  'Колледжи',
  'Самое интересное',
  'Образование',
  'Поступление',
  'Стоимость',
  'Приёмная комиссия',
  'Можно учиться и работать?',
  'Как поступить?',
  'Как выбрать колледж?',
  'Можно учиться и работать?',
];

const setActive = (element) => {
  if (element.classList.contains('active')) {
    element.classList.remove('active');
  } else {
    element.classList.add('active');
  }
};

const news = [
  {
    title: 'Изменения в процедуре поступления в колледжи в 2024 году: что нового?',
    tags: ['Новость', 'Колледжи'],
    date: '09.02.24',
  },
  {
    title: 'Цифровизация поступления: как колледжи используют ИИ для отбора кандидатов',
    tags: ['Новость', 'Колледжи'],
    date: '09.02.24',
  },
  {
    title: 'Глобальные инициативы для упрощения поступления иностранных студентов',
    tags: ['Новость', 'Колледжи'],
    date: '09.02.24',
  },
  {
    title: 'Станьте частью будущего с нашим вебинаром по успешному поступлению',
    tags: ['Реклама'],
    date: '09.02.24',
  },
  {
    title: 'Подготовка к поступлению: летние курсы и специализированные программы для абитуриентов',
    tags: ['Новость', 'Колледжи'],
    date: '09.02.24',
  },
  {
    title: 'Подготовка к поступлению: летние курсы и специализированные программы для абитуриентов',
    tags: ['Новость', 'Колледжи'],
    date: '09.02.24',
  },
  {
    title: 'Влияние COVID–19 на поступление в колледжи: адаптация процессов ',
    tags: ['Новость', 'Колледжи'],
    date: '09.02.24',
  },
  {
    title: 'Колледжи вводят виртуальные дни открытых дверей: новая эра поступления',
    tags: ['Новость', 'Колледжи'],
    date: '09.02.24',
  },
  {
    title: 'Рост стипендий для малообеспеченных студентов: новые программы поддержки',
    tags: ['Новость', 'Колледжи'],
    date: '09.02.24',
  },
  {
    title: 'Изменения в процедуре поступления в колледжи в 2024 году: что нового?',
    tags: ['Новость', 'Колледжи'],
    date: '09.02.24',
  },
  {
    title: 'Цифровизация поступления: как колледжи используют ИИ для отбора кандидатов',
    tags: ['Новость', 'Колледжи'],
    date: '09.02.24',
  },
  {
    title: 'Станьте частью будущего с нашим вебинаром по успешному поступлению',
    tags: ['Новость', 'Колледжи'],
    date: '09.02.24',
  },
  {
    title: 'Глобальные инициативы для упрощения поступления иностранных студентов',
    tags: ['Новость', 'Колледжи'],
    date: '09.02.24',
  },
  {
    title: 'Станьте частью будущего с нашим вебинаром по успешному поступлению',
    tags: ['Реклама'],
    date: '09.02.24',
  },
  {
    title: 'Подготовка к поступлению: летние курсы и специализированные программы для абитуриентов',
    tags: ['Новость', 'Колледжи'],
    date: '09.02.24',
  },
  {
    title: 'Подготовка к поступлению: летние курсы и специализированные программы для абитуриентов',
    tags: ['Новость', 'Колледжи'],
    date: '09.02.24',
  },
];
</script>

<style lang="scss" scoped>
@import './blog-news.scss';
</style>
