<template>
  <section class="s-policy section-l">
    <div class="container">
      <h1 class="title-h2 s-policy__title">{{ pageTitle }}</h1>
      <div class="s-policy__wrapper">
        <div class="s-policy__box">
          <p class="f-text-m">
            Настоящая Политика конфиденциальности персональных данных (далее - Политика конфиденциальности) является
            неотъемлемой частью Публичной оферты, размещенной на сайте в сети Интернет по адресу: https://ruscollege.ru/
            (далее – «Сайт») – ОБЩЕСТВА С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "ИННОВАЦИОННЫЕ ОБРАЗОВАТЕЛЬНЫЕ ТЕХНОЛОГИИ"
            105318, РОССИЯ, Г. МОСКВА, ИЗМАЙЛОВСКИЙ ВАЛ УЛ., Д. 2, ЭТАЖ 6, ПОМЕЩ. 1, КОМНАТА 23 ОГРН:1217700187539, Дата
            присвоения ОГРН: 19.04.2021, ИНН: 743359579, КПП: 771901001 (далее – «Оператор»).
          </p>
          <p class="f-text-m">
            Использование сервисов Сайта означает безоговорочное согласие Пользователя с настоящей Политикой и
            указанными в ней условиями обработки его персональной информации; в случае несогласия с этими условиями
            Пользователь должен воздержаться от использования сервисов.
          </p>
        </div>
        <div class="s-policy__box">
          <h2 class="title-h4">1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
          <p class="f-text-m">1.1. В рамках настоящей Политики под персональной информацией Пользователя понимаются:</p>
          <p class="f-text-m">
            1.1.1. Персональная информация, которую Пользователь предоставляет о себе самостоятельно в процессе
            использования Сервисов, включая персональные данные Пользователя. Обязательная для предоставления Сервисов
            информация помечена специальным образом.
          </p>
          <p class="f-text-m">
            1.1.2. Данные, которые автоматически передаются сервисам Сайта в процессе их использования с помощью
            установленного на устройстве Пользователя программного обеспечения, в том числе IP-адрес, данные файлов
            cookie, информация о браузере Пользователя (или иной программе, с помощью которой осуществляется доступ к
            сервисам), технические характеристики оборудования и программного обеспечения, используемых Пользователем,
            дата и время доступа к сервисам, адреса запрашиваемых страниц, территориальное\региональное место
            нахождения, точки входа (сторонние сайты, с которых пользователь по ссылке переходит на сайты Оператора); —
            точки выхода (ссылки на сайтах Оператора, по которым пользователь переходит на сторонние сайты), а так же
            иная подобная информация.
          </p>
          <p class="f-text-m">
            1.1.3. Настоящая Политика конфиденциальности применяется только к Сайту. Сайт не контролирует и не несет
            ответственности за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на Сайте.
          </p>
        </div>
        <div class="s-policy__box">
          <h2 class="title-h4">2. ОБРАБОТКА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ</h2>
          <p class="f-text-m">
            2.1. Оператором, в целях обеспечения обратной связи, могут обрабатываться следующие персональные данные
            Пользователя:
          </p>
          <p class="f-text-m">2.1.1. ФИО или только часть 2.1.2. Дата рождения</p>
          <p class="f-text-m">2.1.3. Адрес электронной почты 2.1.4. Контактный телефон 2.1.5. Почтовый адрес</p>
          <p class="f-text-m">
            2.2. Для использования различных сервисов Платформы, Пользователь может воспользоваться предоставлением
            доступа к учетным записям сторонних поставщиков услуг, включая, среди прочего, общедоступное хранилище
            файлов, службу обмена мгновенными сообщениями, социальные сети и т. д. В этом случае Администрация может
            получать от третьих лиц дополнительные персональные данные, включая, в частности, пол, местоположение,
            аватар пользователя (userpic) и т. д. Вся информация, доступная через стороннего поставщика услуг,
            обрабатывается и хранится в соответствии с Пользовательским соглашением и Политикой конфиденциальности.
          </p>
          <p class="f-text-m">
            2.3. Также на сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов «cookie») с
            помощью сервисов интернет- статистики (Яндекс Метрика и других).
          </p>
        </div>
        <div class="s-policy__box">
          <h2 class="title-h4">3. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ</h2>
          <p class="f-text-m">3.1. Цель обработки персональных данных Пользователя:</p>
          <p class="f-text-m">
            – предоставление информации об оказываемых услугах высшими и(или) средне-специальными учебными заведениями,
            имеющими установленные нормами законодательства Российской Федерации аккредитацию и лицензии в сфере
            образования, а также иными организациями, предоставляющими услуги в области образования;
          </p>
          <p class="f-text-m">– информирование по средствам</p>
          <p class="f-text-m">
            – предоставление доступа Пользователю к сервисам, информации и/или материалам, содержащимся на
            Сайте/Платформе;
          </p>
          <p class="f-text-m">
            – отправки на адрес электронной почты и номер мобильного телефона, указанных Пользователем, информации в
            виде электронных писем, push- уведомлений, СМС-сообщений по каналам связи (СМС-рассылка) и сообщений в
            мессенджеры для оповещения о новостях рынка образования, событий, дней открытых дверей ВУЗов и
            образовательных организаций, а также отправки сервисных/системных сообщений;
          </p>
          <p class="f-text-m">
            - осуществление обратной связи с целью разъяснения, уточнения или подготовки предложения по услугам
            оказываемым Оператором.
          </p>
          <p class="f-text-m">
            3.2. Оператор не проверяет предоставленную Пользователем информацию для обратной связи и не может судить о
            её достоверности, а также о том, обладает ли Пользователь достаточной правоспособностью для предоставления
            персональной информации.
          </p>
          <p class="f-text-m">
            Для конкретных целей либо соответствии с требованиями применимого законодательства Российской Федерации
            Оператор может запросить отдельное согласие Пользователя на обработку персональной информации.
          </p>
          <p class="f-text-m">
            3.3. Обезличенные данные Пользователей, собираемые с помощью сервисов интернет статистики (метрики,
            аналитики и иное), служат для сбора информации о действиях Пользователей на Сайте, улучшения качества сайта
            и его содержания.
          </p>
        </div>

        <div class="s-policy__box">
          <h2 class="title-h4">4. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ</h2>
          <p class="f-text-m">
            4.1. Обработка персональных данных осуществляется с согласия субъекта персональных данных на обработку его
            персональных данных.
          </p>
          <p class="f-text-m">
            4.2. Обработка персональных данных необходима для осуществления прав и законных интересов оператора,
            субъекта персональных данных либо для достижения общественно значимых целей при условии, что при этом не
            нарушаются права и свободы субъекта персональных данных.
          </p>
        </div>
        <div class="s-policy__box">
          <h2 class="title-h4">5. ОСНОВАНИЯ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ</h2>
          <p class="f-text-m">
            5.1. Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки
            Пользователем самостоятельно через специальные формы, расположенные на Сайте, на Платформе или направленные
            Оператору посредством электронной почты. Заполняя соответствующие формы и/или отправляя свои персональные
            данные Оператору, Пользователь выражает свое согласие с данной Политикой.
          </p>
          <p class="f-text-m">
            5.2. Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в настройках
            браузера Пользователя (включено сохранение файлов «cookie» и использование технологии JavaScript).
          </p>
          <p class="f-text-m">
            5.3. Субъект персональных данных самостоятельно принимает решение о предоставлении его персональных данных и
            дает согласие свободно, своей волей и в своем интересе.
          </p>
        </div>
        <div class="s-policy__box">
          <h2 class="title-h4">6. ПЕРЕДАЧА ПЕРСОНАЛЬНЫХ ДАННЫХ ТРЕТЬИМ ЛИЦАМ</h2>
          <p class="f-text-m">
            6.1. Оператор, получив доступ к персональным данным, берёт на себя обязательства не раскрывать третьим лицам
            и не распространять персональные данные без согласия субъекта персональных данных, если иное не
            предусмотрено федеральным законом.
          </p>
          <p class="f-text-m">
            6.2. Оператор может привлекать третьих лиц для обеспечения поддержки клиентов, управления объявлениями на
            сторонних ресурсах, отправления информационных и иных сообщений от имени Оператора. Указанным третьим лицам
            запрещено использовать предоставленные персональные данные для рекламных целей.
          </p>
          <p class="f-text-m">
            6.3. Сайт позволяет использовать сторонние сервисы, интегрированные с Платформой. Используя их субъект
            персональных данных добровольно передает персональные данные и иную информацию. Все персональные данные,
            запрашиваемые третьими лицами, обрабатываются и храниться в соответствии с Пользовательским соглашением и
            Политикой конфиденциальности третьих лиц.
          </p>
        </div>
        <div class="s-policy__box">
          <h2 class="title-h4">7. ХРАНЕНИЕ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ</h2>
          <p class="f-text-m">
            7.1. Полученная персональная информация хранится на носителях информации размещённых на территории в
            Российской Федерации.
          </p>
          <p class="f-text-m">
            7.2. Персональная информация хранится до достижения цели, для какой она была собрана, если иное не
            предусмотрено законодательством Российской Федерации или требованиями нормативных актов.
          </p>
        </div>
        <div class="s-policy__box">
          <h2 class="title-h4">8. ФАЙЛЫ cookie И ДРУГИЕ ПОДОБНЫЕ ТЕХНОЛОГИИ НА САЙТЕ</h2>
          <p class="f-text-m">8.1. Какие файлы cookie и зачем их используются на сайте:</p>
          <p class="f-text-m">
            Файлы cookie — это небольшой фрагмент данных, который принимается и обрабатывается устройством, которое
            использует Пользователь для доступа к Сайтам. Файлы cookie хранят и отправляют обратно на Сайты информацию,
            которая помогает работе с Сайтами и позволяет запоминать предпочтения по истечении времени, например,
            настройки браузера.
          </p>
          <p class="f-text-m">На Сайтах используются следующие типы файлов cookie:</p>
          <ul class="f-text-m">
            <li>
              строго необходимые файлы cookie / технические файлы cookie: эти файлы cookie необходимы для работы Сайтов
              и предоставления Сервисов; кроме всего прочего, они позволяют идентифицировать аппаратное и программное
              обеспечение, включая тип браузера;
            </li>
            <li>
              статистические / аналитические файлы cookie: эти файлы cookie позволяют распознавать пользователей,
              подсчитывать их количество и собирать информацию, такую как произведенные операции на Сайтах и в Сервисах,
              включая информацию о посещенных веб-страницах и контенте, который получает пользователь;
            </li>
            <li>
              технические файлы cookie: эти файлы cookie собирают информацию о том, как пользователи взаимодействуют с
              Сайтами и/или Сервисами, что позволяет выявлять ошибки и тестировать новые функции для повышения
              производительности Сайтов и Сервисов;
            </li>
            <li>
              функциональные файлы cookie: эти файлы cookie позволяют предоставлять определенные функции, чтобы
              облегчить использование Сайтов, например, сохраняя предпочтения пользователя (такие как язык и
              местоположение);
            </li>
            <li>
              (сторонние) файлы отслеживания / рекламные файлы cookie: эти файлы cookie собирают информацию о
              пользователях, источниках трафика, посещенных страницах и рекламе, отображенной для пользователя, а также
              той, по которой Вы перешли на рекламируемую страницу. Они также используются в статистических и
              исследовательских целях.
            </li>
          </ul>
          <p class="f-text-m">
            8.2. Оператор использует информацию, содержащуюся в файлах cookie только в указанных выше целях, после чего
            собранные данные будут храниться на устройстве пользователя в течение периода, который может зависеть от
            соответствующего типа файлов cookie, но не превышая срока, необходимого для достижения их цели, после чего
            они будут автоматически удалены из пользовательской системы.
          </p>
          <p class="f-text-m">
            8.3. При первом посещении Сайта запрашивается согласие на использование файлов cookie. Если после того, как
            пользователь одобрил использование файлов cookie, пользователь захотел изменить свое решение, это возможно
            сделать, удалив файлы cookie, хранящиеся в браузере (обычно это можно сделать в настройках браузера —
            пожалуйста, обратитесь к руководству по работе с браузером или сайту его разработчика). После этого может
            быть снова отображено всплывающее окно, запрашивающее согласие, и пользователь сможет сделать иной выбор.
            Если пользователь отказывается от использования файлов cookie, это может привести к тому, что некоторые
            функции Сайта будут Вам недоступны, и повлияет на возможность использования Вами Cайтов. Пользователь также
            может изменить настройки браузера, чтобы принимать или отклонять по умолчанию все файлы cookie или файлы
            cookie с определенных сайтов.
          </p>
        </div>
        <div class="s-policy__box">
          <h2 class="title-h4">9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h2>
          <p class="f-text-m">
            9.1. Администрация Сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия
            Пользователя.
          </p>
          <p class="f-text-m">
            9.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте, если иное не
            предусмотрено новой редакцией Политики конфиденциальности.
          </p>
          <p class="f-text-m">
            9.3. Оператор приветствует вопросы и предложения, касающиеся исполнения или изменения настоящей Политики, а
            также работы и структуры Сайта. Все предложения или вопросы по настоящей Политике конфиденциальности следует
            сообщать на электронную почту:
            <a href="mailto:support@ruscollege.ru" test-id="link-s-policy-email" class="f-link"
              >support@ruscollege.ru.</a
            >
          </p>
          <p class="f-text-m">9.4. Действующая Политика конфиденциальности размещена на Сайте.</p>
          <p class="f-text-m">
            9.5. Действующая Политика в отношении обработки персональных данных размещена на странице по адресу:
            <a href="https://ruscollege.ru" test-id="link-s-policy-main-1" class="f-link">https://ruscollege.ru/</a>
          </p>
          <p class="f-text-m">
            9.6. Настоящая Политика конфиденциальности является неотъемлемой частью Публичной оферты и Соглашения об
            использовании Сайта, размещенных на странице по адресу:
            <a href="https://ruscollege.ru" test-id="link-s-policy-main-2" class="f-link">https://ruscollege.ru/</a>
          </p>
        </div>
      </div>
    </div>
  </section>
</template>

<script setup>
defineProps({
  pageTitle: { type: String, default: 'Политика конфиденциальности' },
});
</script>

<style lang="scss">
@import './s-policy.scss';
</style>
