<template>
  <section class="s-foru section-l">
    <div class="container">
      <h1 class="title-h2">{{ pageTitle }}</h1>
      <div class="s-foru__box">
        <m-foru-faq v-for="(faq, index) in faqs" :key="index" :faq="faq" :test-id="`dropdown-s-foru-${index + 1}`" />
      </div>
    </div>
  </section>
</template>
<script setup>
defineProps({
  pageTitle: { type: String, default: 'Для колледжей' },
});
const faqs = ref([
  {
    title: 'Информация о колледжах',
    text:
      'Информация о колледжах была предварительно заполнена по данным представленным ' +
      'на сайте Национального аккредитационного агентства в сфере образования (Росаккредагентство). ' +
      'Информация по колледжам ежегодно синхронизируется с данными из Минобрнаука и обновляется.',
  },
  {
    title: 'Изменение информации о колледже',
    text:
      'Если Вы заметили, что на сайте представлена некорректная ' +
      'информация о колледже или Вы представитель колледжа и хотите ' +
      'добавить, обновить или изменить информацию о Вашем колледже, ' +
      'то отправьте: свои контактные данные и наименование колледжа ' +
      '(по которому хотите внести изменения) по ' +
      "адресу: <a href='mailto:ed123@колледжи.рф' class='f-link'>ed123@колледжи.рф.</a>",
  },
  {
    title: 'Отсутствие колледжа на сайте',
    text:
      'Мы не добавляем колледжи по запросам пользователей. ' +
      'Колледжи для проекта ежегодно отбираются в соответствии ' +
      'с внутренней политикой, которая предусматривает наличие не ' +
      'менее чем 90% учебных заведений от их общего количества,' +
      ' если вы не попали в данное число, скорее всего наш проект ' +
      'не подходит для вашего колледжа или мы еще не ' +
      'заметили ваш колледж.',
  },
  {
    title: 'Ответы на отзывы и вопросы о колледже',
    text:
      'По каждому колледжу пользователи могут оставлять ' +
      'свои отзывы и вопросы. Наши специалисты ежедневно' +
      ' на связи и отвечают по каждому колледжу, помогая' +
      ' абитуриентам и поддерживая с ними связь. Если Вы' +
      ' являетесь представителем и хотите получать от ' +
      'пользователей сайта Колледжи.рф обратную связь, ' +
      "то <a href='mailto:ed123@колледжи.рф' class='f-link'>оставьте заявку ниже</a>, " +
      'и мы свяжемся с Вами.',
  },
  {
    title: 'Как определяется порядок расположения колледжа',
    text:
      'Позиция вуза в каталоге определяется ' +
      'множеством факторов, таких как актуальность и полнота данных,' +
      ' значения формальных показателей, социальные' +
      ' факторы и многое другое. Вузы ранжируются ' +
      'в соответствии с внутренними алгоритмами, ' +
      'механизмы которых не раскрываются.',
  },
  {
    title: 'Другой вопрос',
    text:
      'Если вы представитель колледжа ' +
      'и не нашли ответ на свой вопрос, ' +
      'то можете написать письмо с Вашим вопросом ' +
      "нам на почту: <a href='mailto:ed123@колледжи.рф' class='f-link'>ed123@колледжи.рф.</a>" +
      ' Наши специалисты свяжутся с вами ' +
      'и ответят на ваш вопрос',
  },
]);
</script>
<style lang="scss">
@import './s-foru.scss';
</style>
