<template>
  <div class="reviews">
    <h3 class="title-h3">{{ pageTitle }}</h3>
    <div class="reviews__content">
      <m-review-card
        v-for="(review, index) in reviews"
        :id="review.id"
        :key="index"
        :reviewText="review.text"
        :photos="review.photos"
        :rating="review.rating"
        :edu="review.edu"
        :atmosphere="review.atmosphere"
        :teachers="review.teachers"
        :activity="review.activity"
        :answers="review.answers"
        :likes="review.likes"
        :dislikes="review.dislikes"
        @changeLikes="changeLikes"
      />
    </div>
    <a-pagination :curPage="curPage" :countPage="countPage" @updateCurPage="updateCurPage" />
  </div>
</template>

<script setup>
import useCanonicalHead from '~/composables/useCanonicalHead';

useCanonicalHead();

definePageMeta({
  layout: 'layout-college-review',
  validate() {
    return false;
  },
});
const curPage = ref(0);
const countPage = ref(10);
const pageTitle = ref('Отзывы о колледже');

useHead({
  title: `${pageTitle.value} | Колледжи.рф`,
  // eslint-disable-next-line max-len
  description: `${pageTitle.value}. Лучший сайт для абитуриентов колледжей. Помогаем с подбором профессии, сравнением колледжей, подсчетом баллов ЕГЭ и ОГЭ. Начните путь к успешной карьере с нами!`,
});

const updateCurPage = (num) => {
  curPage.value = num;
};

const changeLikes = ({ id, likes, dislikes }) => {
  if (likes) {
    reviews.value[id].likes = likes;
  }
  if (dislikes) {
    reviews.value[id].dislikes = dislikes;
  }
};

const reviews = ref([
  {
    id: 0,
    text: `Лишь некоторые особенности внутренней политики лишь добавляют 
    фракционных разногласий и призваны к ответу. В частности, разбавленное 
    изрядной долей эмпатии, рациональное мышление напрямую зависит от прогресса 
    профессионального сообщества. Картельные сговоры не допускают ситуации, 
    при которой явные признаки победы институционализации являются только методом 
    политического участия и призваны к ответу. Как уже неоднократно упомянуто,
    акционеры крупнейших компаний ассоциативно распределены по отраслям. 
    Но элементы политического процесса представляют собой не что иное, 
    как квинтэссенцию победы маркетинга над разумом и должны быть призваны к ответу.`,
    photos: ['/img/college/photo/photo-1.jpg', '/img/college/photo/photo-2.jpg', '/img/college/photo/photo-3.jpg'],
    rating: 5,
    edu: '80%',
    atmosphere: '60%',
    teachers: '70%',
    activity: '100%',
    likes: 0,
    dislikes: 0,
    answers: [
      {
        name: 'Саша Кимова',
        date: '30 ноября 2023',
        text: `Лишь некоторые особенности внутренней политики 
        лишь добавляют фракционных разногласий и призваны к ответу. 
        В частности, разбавленное изрядной долей эмпатии, 
        рациональное мышление напрямую зависит от прогресса профессионального сообщества.`,
      },
      {
        name: 'Михаил Ефимов',
        date: '24 ноября 2023',
        text: `Лишь некоторые особенности внутренней политики 
        лишь добавляют фракционных разногласий и призваны к ответу. 
        В частности, разбавленное изрядной долей эмпатии, 
        рациональное мышление напрямую зависит от прогресса профессионального сообщества.`,
      },
      {
        name: 'Владислав Залесский',
        date: '25 ноября 2023',
        text: `Лишь некоторые особенности внутренней политики 
        лишь добавляют фракционных разногласий и призваны к ответу. 
        В частности, разбавленное изрядной долей эмпатии, 
        рациональное мышление напрямую зависит от прогресса профессионального сообщества.`,
      },
    ],
  },
  {
    id: 1,
    text: `Лишь некоторые особенности внутренней политики лишь добавляют 
    фракционных разногласий и призваны к ответу. В частности, разбавленное 
    изрядной долей эмпатии, рациональное мышление напрямую зависит от прогресса 
    профессионального сообщества. Картельные сговоры не допускают ситуации, 
    при которой явные признаки победы институционализации являются только методом 
    политического участия и призваны к ответу. Как уже неоднократно упомянуто,
    акционеры крупнейших компаний ассоциативно распределены по отраслям. 
    Но элементы политического процесса представляют собой не что иное, 
    как квинтэссенцию победы маркетинга над разумом и должны быть призваны к ответу.`,
    photos: ['/img/college/photo/photo-1.jpg', '/img/college/photo/photo-2.jpg', '/img/college/photo/photo-3.jpg'],
    rating: 4.5,
    edu: '70%',
    atmosphere: '60%',
    teachers: '60%',
    activity: '80%',
    likes: 0,
    dislikes: 0,
  },
  {
    id: 2,
    text: `Лишь некоторые особенности внутренней политики лишь добавляют 
    фракционных разногласий и призваны к ответу. В частности, разбавленное 
    изрядной долей эмпатии, рациональное мышление напрямую зависит от прогресса 
    профессионального сообщества. Картельные сговоры не допускают ситуации, 
    при которой явные признаки победы институционализации являются только методом 
    политического участия и призваны к ответу. Как уже неоднократно упомянуто,
    акционеры крупнейших компаний ассоциативно распределены по отраслям. 
    Но элементы политического процесса представляют собой не что иное, 
    как квинтэссенцию победы маркетинга над разумом и должны быть призваны к ответу.`,
    photos: ['/img/college/photo/photo-1.jpg', '/img/college/photo/photo-2.jpg', '/img/college/photo/photo-3.jpg'],
    rating: 4,
    edu: '60%',
    atmosphere: '70%',
    teachers: '40%',
    activity: '80%',
    likes: 0,
    dislikes: 0,
    answers: [
      {
        name: 'Михаил Ефимов',
        date: '24 ноября 2023',
        text: `Лишь некоторые особенности внутренней политики 
        лишь добавляют фракционных разногласий и призваны к ответу. 
        В частности, разбавленное изрядной долей эмпатии, 
        рациональное мышление напрямую зависит от прогресса профессионального сообщества.`,
      },
      {
        name: 'Владислав Залесский',
        date: '25 ноября 2023',
        text: `Лишь некоторые особенности внутренней политики 
        лишь добавляют фракционных разногласий и призваны к ответу. 
        В частности, разбавленное изрядной долей эмпатии, 
        рациональное мышление напрямую зависит от прогресса профессионального сообщества.`,
      },
    ],
  },
]);
</script>

<style>
@import './reviews.scss';
</style>
