<template>
  <section class="s-policy section-l">
    <div class="container">
      <h1 class="title-h2 s-policy__title">{{ pageTitle }}</h1>
      <div class="s-policy__wrapper">
        <div class="s-policy__box">
          <p class="f-text-m">
            В соответствии со ст. 9 Федерального закона от 27.07.2006 № 152-ФЗ «О защите персональных данных» даю своё
            согласие ОБЩЕСТВУ С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "ИННОВАЦИОННЫЕ ОБРАЗОВАТЕЛЬНЫЕ ТЕХНОЛОГИИ" 105318, РОССИЯ,
            Г. МОСКВА, ИЗМАЙЛОВСКИЙ ВАЛ УЛ., Д. 2, ЭТАЖ 6, ПОМЕЩ. 1, КОМНАТА 23 ОГРН:1217700187539, Дата присвоения
            ОГРН: 19.04.2021, ИНН: 743359579, КПП: 771901001 (далее – «Оператор»), на обработку и использование моих
            (Поступающего/Обучающегося) персональных данных.
          </p>
          <p class="f-text-m italic">
            Обработка персональных данных осуществляется с целью соблюдения Конституции Российской Федерации,
            федеральных законов и иных нормативных правовых актов Российской Федерации, содействия в оптимальном выборе
            образовательных программ, обеспечения соблюдения правил приема в соответствии с законодательством РФ и
            нормативными документами учебного заведения, гласности и открытости деятельности приемной комиссии.
          </p>
          <p class="f-text-m">Перечень персональных данных, на обработку которых дается согласие:</p>
          <ol class="f-text-m">
            <li>
              Фамилия, имя, отчество, год, месяц, дата и место рождения, адрес регистрации, адрес фактического места
              жительства.
            </li>
            <li>Контактный телефон, электронная почта.</li>
            <li>Фотографическое изображение.</li>
            <li>
              Контактная информация и любая иная информация, относящаяся к моей личности, доступная либо известная в
              любой конкретный момент времени Оператору.
            </li>
          </ol>
          <p class="f-text-m">
            Подтверждаю, что, давая настоящее согласие, я действую без какого-либо принуждения, своей волей и в своих
            интересах. Согласие даётся мной для целей организации и проведения приема на обучение в учебное заведение (в
            том числе для целей заключения договора об образовании), а в случае моего зачисления, осуществления
            образовательного процесса учебным заведением, а также представления информации, относящейся к моим
            персональным данным, по запросам третьих лиц, связанных с получением мной образования, трудоустройством и в
            иных случаях, предусмотренных законодательством РФ.<br />
            В целях обеспечения исполнения обязательств по содействию в оптимальном выборе образовательных программ,
            обеспечения соблюдения правил приема, Оператор осуществляет сбор, систематизацию, накопление, хранение,
            уточнение (обновление, изменение), использование, распространение (в том числе передачу), обезличивание,
            блокирование, уничтожение Данных (общее описание вышеуказанных способов обработки Данных приведено в
            Федеральном законе от 27 июля 2006 г. №152-ФЗ «О персональных данных»).<br />
            Мне известно, что обработка персональных данных осуществляется Оператором на электронных носителях с
            использованием средств автоматизации.<br />
            течение неограниченного срока времени, до отзыва мной данного согласия в письменной форме по средствам
            электронного обращения либо до достижения целей обработки с учетом требований законодательства Российской
            Федерации в области защиты персональных данных.<br />
          </p>
        </div>
        <div class="s-policy__box">
          <h2 class="title-h4">
            Cогласие на обработку персональных данных, разрешенных субъектом персональных данных для распространения
          </h2>
          <p class="f-text-m">
            Я, руководствуясь статьей 10.1 Федерального закона № 152-ФЗ от 27.07.2006 «О персональных данных», заявляю о
            согласии на распространение моих персональных данных оператором, ОБЩЕСТВОМ С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ
            "ИННОВАЦИОННЫЕ ОБРАЗОВАТЕЛЬНЫЕ ТЕХНОЛОГИИ" 105318, РОССИЯ, Г. МОСКВА, ИЗМАЙЛОВСКИЙ ВАЛ УЛ., Д. 2, ЭТАЖ 6,
            ПОМЕЩ. 1, КОМНАТА 23 ОГРН:1217700187539, Дата присвоения ОГРН: 19.04.2021, ИНН: 743359579, КПП: 771901001
            (далее – «Оператор»).
          </p>
          <p class="f-text-m">
            Настоящее согласие дается с целью обеспечения соблюдения положений нормативных правовых актов: Федерального
            закона от 29.12.2012 N 273-ФЗ «Об образовании в Российской Федерации», Приказа Минобрнауки России от
            21.08.2020 N 1076 «Об утверждении Порядка приема на обучение по образовательным программам высшего
            образования - программам бакалавриата, программам специалитета, программам магистратуры», Приказа
            Минобрнауки России от 06.04.2021 N 245 «Об утверждении Порядка организации и осуществления образовательной
            деятельности по образовательным программам высшего образования - программам бакалавриата, программам
            специалитета, программам магистратуры», Постановление Правительства Российской Федерации от 03.04.2023 № 528
            "Об утверждении особенностей приема на обучение по образовательным программам высшего образования, имеющим
            государственную аккредитацию, программам подготовки научных и научно-педагогических кадров в аспирантуре
            (адъюнктуре) в 2023 году", Приказ Минобрнауки России от 01.03.2023 № 231 "Об утверждении особенностей приема
            на обучение в организации, осуществляющие образовательную деятельность, по программам бакалавриата,
            программам специалитета, программам магистратуры и программам подготовки научно-педагогических кадров в
            аспирантуре (адъюнктуре), предусмотренных частями 7 и 8 статьи 5 федерального закона от 17 февраля 2023 г. №
            19-фз "Об особенностях правового регулирования отношений в сферах образования и науки в связи с принятием в
            Российскую Федерацию Донецкой Народной Республики, Луганской Народной Республики, Запорожской области,
            Херсонской области и образованием в составе Российской Федерации новых субъектов - Донецкой Народной
            Республики, Луганской Народной Республики, Запорожской области, Херсонской области и о внесении изменений в
            отдельные законодательные акты Российской Федерации", Приказа Минобрнауки России от 06.06.2013 N 443 «Об
            утверждении Порядка и случаев перехода лиц, обучающихся по образовательным программам среднего
            профессионального и высшего образования, с платного обучения на бесплатное», Приказа Минобрнауки России от
            12.07.2021 N 607 «Об утверждении Порядка перевода обучающегося в другую образовательную организацию,
            реализующую образовательную программу высшего образования соответствующего уровня», а также в целях
            содействия в оптимальном выборе образовательных программ, обеспечения соблюдения правил приема в
            соответствии с законодательством РФ и нормативными документами учебного заведения, гласности и открытости
            деятельности приемной комиссии. В вышеуказанных целях распространение персональных данных осуществляется в
            следующем порядке:
          </p>
        </div>
        <div class="s-policy__box">
          <table class="f-text-m">
            <tr>
              <th>Категория субъектов персональных данных</th>
              <th>Перечень персональных данных, разрешенных к распространению</th>
              <th>Цели обработки</th>
            </tr>
            <tr>
              <td>общие персональные данные</td>
              <td>
                - IP адрес;<br />
                - Сведения о пользовательском устройстве и используемом браузере; - Сведения о взаимодействии с сайтом и
                сервисами Оператора (источник перехода на сайт, просматриваемые страницы, взаимодействие с объектами и
                страницами, параметры сессии, данные о времени посещения и пр.);<br />
                - Файлы cookie
              </td>
              <td>
                - Обеспечение корректного функционирования сайта, программного обеспечения, сервисов и услуг;<br />
                - Сохранения настроек использования сайта;<br />
                - Проведение анализа информации, необходимой для улучшения программного обеспечения, сервисов и услуг; -
                Направление рекламной информации (в том числе в форме рекламной рассылки) с использованием любых средств
                связи персонализация рекламы и предложений с учетом предпочтений Пользователя.
              </td>
            </tr>
            <tr>
              <td>Зарегистрированные в личном кабинете Пользователи сайта</td>
              <td>
                - Ф.И.О.;<br />
                - Контактный номер телефона;<br />
                - Адрес электронной почты;<br />
                - Фотографическое изображение;<br />
                - Уровень образования;<br />
                - Город;<br />
                - Дата рождения;<br />
                - Пол;<br />
                - Сведения об интересных для клиента учебных заведениях и программах.<br />
              </td>
              <td>
                - Предоставление Пользователю возможности использования программного обеспечения, сервисов и услуг,
                включая создание учетной записи, авторизацию под учетной записью<br />
                - Надлежащее исполнение пользовательских соглашений
              </td>
            </tr>
            <tr>
              <td>Пользователи сайта и клиенты, заполнившие форму обратной связи</td>
              <td>
                - Ф.И.О.;<br />
                - Контактный номер телефона;<br />
                - Адрес электронной почты;<br />
                - Сведения об интересных для клиента учебных заведениях и программах;<br />
                - Геолокация (город проживания);<br />
                - Сведения об обращении.
              </td>
              <td>
                Обработка обращений и установление с Пользователем обратной связи, в том числе: <br />
                - Продажи услуг кампании<br />
                - Оказание поддержки, консультации клиентам по вопросам образования
              </td>
            </tr>
            <tr>
              <td>Клиенты - абитуриенты</td>
              <td>
                - Ф.И.О.;<br />
                - Контактный номер телефона;<br />
                - Адрес электронной почты;<br />
                - Серия и номер паспорта, дата выдачи паспорта, код подразделения, наименование органа, выдавшего
                паспорт; адрес регистрации; адрес фактического проживания.
              </td>
              <td>Оформление предварительного договора на поступление в партнерские учебные заведения</td>
            </tr>
            <tr>
              <td>Клиенты – студенты, партнерских учебных заведений.</td>
              <td>
                - Ф.И.О.;<br />
                - Контактный номер телефона;<br />
                - Адрес электронной почты;<br />
                - Пол;<br />
                - Дата рождения;<br />
                - Место рождения;<br />
                - Серия и номер паспорта, дата выдачи паспорта, код подразделения, наименование органа, выдавшего
                паспорт;<br />
                - Адрес регистрации;<br />
                - Адрес фактического проживания;<br />
                - ИНН;<br />
                - СНИЛС;<br />
                - Справка 086У;<br />
                - Сумма конкурсных баллов (за вступительные испытания и индивидуальные достижения);<br />
                - Сумма баллов за вступительные испытания, количество баллов за каждое вступительное испытание<br />
                - Основание приема без вступительных испытаний;<br />
                -Количество баллов за индивидуальные достижения;<br />
                - Наличие преимущественных прав зачисления;<br />
                - Заказчик целевого обучения;<br />
                - № дела поступающего;<br />
                - № дела студента;<br />
                - Перечень учебных, научных и иных достижений (портфолио), а также сведения о наличии соответствующего
                основания для перевода с платного обучения на бесплатное в соответствии с Приказом Минобрнауки России от
                06.06.2013 N 443;<br />
                - Курс обучения, факультет, специальность (направление подготовки)<br />
                - Фотография.
              </td>
              <td>Оформление предварительного договора на поступление в партнерские учебные заведения</td>
            </tr>
          </table>
        </div>
      </div>
    </div>
  </section>
</template>

<script setup>
defineProps({
  pageTitle: {
    type: String,
    default: 'Согласие на обработку персональных данных Поступающего',
  },
});
</script>

<style lang="scss">
@import '../s-policy/s-policy.scss';
</style>
